test-results/owsaggregate30.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Thread Group:metadata,2117,225,148,424,677,1159,115,1793,0.000%,3.13648,3.93,1.16
Thread Group:placements,2117,1278,1215,1636,1793,2219,812,3531,0.000%,3.13535,15.21,1.27
Thread Group:source-of-streams,2110,698,661,913,1058,1479,279,2643,0.000%,3.13541,2.19,1.18
Thread Group:streams-breakdown,2106,411,342,638,786,1093,281,4010,0.000%,3.13265,4.49,1.18
Thread Group:streams,2105,565,489,811,988,1321,395,2389,0.000%,3.13288,66.15,1.15
Thread Group:downloads,2104,437,344,720,887,1194,276,2308,0.000%,3.13371,19.46,1.16
Thread Group:playlists,2100,824,747,1158,1283,1643,491,3052,0.000%,3.12806,9.16,1.19
Thread Group:top-countries-streams,2095,575,615,835,954,1265,272,2748,0.000%,3.12430,24.45,1.19
Thread Group:top-countries-downloads,2094,401,329,640,775,1094,272,1734,0.000%,3.12843,11.45,1.20
Thread Group:demographics,2094,422,336,690,822,1137,272,2013,0.000%,3.12839,1.74,1.17
Thread Group:top-sound-recordings,2093,428,334,691,809,1063,266,2235,0.000%,3.12864,6.57,1.10
Thread Group:recent-placements,2092,1990,1896,2605,2859,3351,1234,4180,0.000%,3.12314,27.76,1.12
Thread Group:feeds,2090,478,446,641,720,939,98,1514,0.000%,3.13155,8.60,1.06
Thread Group:product,2088,604,537,822,970,1420,445,3075,0.000%,3.13052,4.14,1.09
Thread Group:product-metadata,2087,233,153,459,675,1172,117,1662,0.000%,3.13401,5.83,1.12
TOTAL,31492,638,485,1299,1745,2470,98,4180,0.000%,46.57388,209.51,17.20